{
    "overview": {
        "hello": "Hi, I'm",
        "first_para": "Welcome to my world, new visitor !",
        "second_para": "At first, you might be wondering why you took the time to create this world at all.",
        "third_para": "Simply so that anyone who's a little curious and wants to set off on a journey to get to know me better can do so in the best possible way.",
        "fourth_para": "So if you're ready to brave any danger, fasten your seatbelt and let's get moving !",
        "fifth_para": "Otherwise I've left you 3 little buttons so you can find out more about me and my work without putting yourself in danger, so don't hesitate to have a look too.",
        "embark": "Scroll and embark on a tour"
    },
    "languages": {
        "french": "French",
        "english": "English"
    },
    "satellites": {
        "about_me": "About me",
        "skills": "Skills",
        "experiences": "Experiences",
        "projects": "Projects",
        "contact_me": "Contact me"
    },
    "not_found": {
        "user_lost": "You've probably got lost",
        "url_not_found": "What you're looking for doesn't or no longer exists in this universe"
    },
    "portfolio": {
        "menu": "Menu"
    },
    "about_me": {
        "title": "About me",
        "type_writer_1": "Young developper in the IT world",
        "type_writer_2": "Always learning new things",
        "first_para": "Ohhh, you're here already ? Yes, it's me speaking to you, on your right, I'll be your guide throughout your journey here. You can call me Astr0ruj !",
        "second_para": "To begin the visit, what better way than with a little introduction to myself.",
        "third_para": "I am a 26 years old french engineer who started his career in the world of AI, image processing and computer vision.",
        "fourth_para": "Since 2 years and a half, I am a self-taught frontend developer in the vast world of mobile and web development.",
        "fifth_para": "Why not learn the backend to become a full stack developer soon ?"
    },
    "skills": {
        "title": "Skills",
        "skill_title_1": "My beginnings in development",
        "skill_paragraph_1": "I made my debut in the world of development at the age of 18 by learning Python. \n\nI liked this experience so much that I decided to continue my studies by enrolling in an integrated preparatory cycle and finally in an engineering school: ISEN Toulon. \nDuring these years, I was able to learn to understand, analyse and think about simple, understandable and clean code by learning the basics of development on technologies such as C. \n\nI was also able to learn more by doing a work placement with the Atlantic group in the network and cybersecurity team.",
        "skill_title_2": "My self-taught apprenticeship",
        "skill_paragraph_2": "After graduating from my engineering course as an engineer in image processing and artificial intelligence and not seeing my future career in this field, I decided to turn towards entrepreneurship and mobile and web development on a self-taught basis with the Pépite Toulon programme. \n\nWith their help and on my own, I was able to learn a bit more about the world of entrepreneurship and mobile programming, in particular with the Flutter framework over the course of a year.",
        "skill_title_3": "Years as a front-end developer",
        "skill_paragraph_3": "After this year focused on my self-taught skills development, I decided to discover and fulfil my potential in the world of work with my first permanent contract in a start-up company. \n\nThose years enabled me to learn a lot about mobile front-end development in Flutter, but also in other technologies such as native React, by taking part in projects for clients and eventually becoming a front-end lead dev. \n\nIn my spare time, I've also been able to improve my skills by working on personal projects, both mobile and web.",
        "skill_title_4": "Why not a back-end developer?",
        "skill_paragraph_4": "I've talked a lot about my increasing skills in front-end development, but what about back-end development? \n\nI've been able to participate in additions and modifications to certain projects using Node js, but I still have a lot to learn in order to become a full stack developer.",
        "skill_title_5": "What's next?",
        "skill_paragraph_5": "What an adventure! So what's next? \n\nAs I said, in the near future I'd like to become a full stack developer and, as my career progresses, I'll always enjoy what I do and always be learning new things and new technologies."
    },
    "experiences": {
        "title": "Experiences",
        "title_experience_1": "Lead dev front",
        "company_experience_1": "Digital Paca",
        "date_experience_1": "October 2021 - Today",
        "point_1_experience_1": "Development from scratch of an Android/iOS mobile and web solution for donations of vaccines between doctors/pharmacists,... Reference: Sauve mon vaccin",
        "point_2_experience_1": "Redesign/improvement, with design imposed by the client, of an Android/iOS mobile cruise booking solution. Reference: Corsica Ferries",
        "point_3_experience_1": "Development from scratch of an Android/iOS mobile application to display information about sports tournaments organised by the client. Reference: Madewis",
        "point_4_experience_1": "Development from scratch of an Android/iOS mobile solution for a social network to meet people with the same interests. Reference: Hobbies",
        "point_5_experience_1": "Development from scratch for a French organisation of an Android/iOS mobile solution to facilitate the display of attendees/absentees during training courses. Reference: La croix rouge française",
        "title_experience_2": "Étudiant entrepreneur",
        "company_experience_2": "Pépite Toulon",
        "date_experience_2": "2020 - 2021",
        "point_1_experience_2": "Self-taught mobile development skills",
        "point_2_experience_2": "Creating a first version of an application from scratch",
        "title_experience_3": "Engineering internship",
        "company_experience_3": "Groupe Atlantic",
        "date_experience_3": "July 2019 - October 2019",
        "point_1_experience_3": "Drawing up the company's cyber security strategy"
    },
    "projects": {
        "title_pro": "Professional projects",
        "title_private": "Personal projects",
        "title_project_pro_1": "Sauve mon vaccin",
        "content_project_pro_1": "Development from scratch of an Android/iOS mobile and web Flutter solution for donations of vaccines between doctors/pharmacists,...",
        "title_project_pro_2": "Corsica Ferries",
        "content_project_pro_2": "Redesign/improvement, with design imposed by the client, of an Android/iOS mobile solution in native React for booking cruises.",
        "title_project_pro_3": "Madewis",
        "content_project_pro_3": "Development from scratch of an Android/iOS mobile application in Flutter to display information about sports tournaments organised by the client.",
        "title_project_pro_4": "Hobbies",
        "content_project_pro_4": "Development from scratch of an Android/iOS mobile solution in Flutter for a social network to meet people with the same interests.",
        "title_project_pro_5": "La croix rouge française",
        "content_project_pro_5": "Development from scratch for a French organisation of an Android/iOS mobile solution using Flutter to facilitate the display of attendees/absentees during training sessions.",
        "title_project_perso_1": "Gemu",
        "content_project_perso_1": "Version 1 of a social networking application for people interested in e-sports and video games developed in Flutter and linked to a Firebase server. Why not a version 2, to be continued....",
        "title_project_perso_2": "My youkounkoun",
        "content_project_perso_2": "An application with a wide variety of basic and complex functions that are very useful when creating a new application. Why start from scratch every time? The front-end application is being developed with Flutter, while the back-end will be developed in Node.js and linked to the MySQL database.",
        "title_project_perso_3": "Portfolio 3D",
        "content_project_perso_3": "Personal website and portfolio to show my work to everyone. This site is developed in React js with Three js."
    },
    "contact_me": {
        "title": "Contact me",
        "title_name": "Your name",
        "label_name": "What's your name ?",
        "title_post": "Your post",
        "label_post": "What's your post ?",
        "title_email": "Your email",
        "label_email": "What's your email ?",
        "title_message": "Your message",
        "label_message": "What do you want to say ?",
        "send": "Send",
        "loading_send": "Sending...",
        "title_validate": "Mail sent",
        "content_validate": "Thank you. I will get back to you as soon as possible.",
        "title_error": "Error",
        "content_error_1": "Not all fields are filled in.",
        "content_error_2": "Something went wrong."
    },
    "wip": {
        "label": "Work still in progress..."
    }
}