{
    "overview": {
        "hello": "Hi, I'm",
        "first_para": "Welcome to my world, new visitor !",
        "second_para": "At first, you might be wondering why you took the time to create this world at all.",
        "third_para": "Simply so that anyone who's a little curious and wants to set off on a journey to get to know me better can do so in the best possible way.",
        "fourth_para": "So if you're ready to brave any danger, fasten your seatbelt and let's get moving !",
        "fifth_para": "Otherwise I've left you 3 little buttons so you can find out more about me and my work without putting yourself in danger, so don't hesitate to have a look too.",
        "embark": "Scroll and embark on a tour"
    },
    "languages": {
        "french": "French",
        "english": "English"
    },
    "satellites": {
        "about_me": "About me",
        "skills": "Skills",
        "experiences": "Experiences",
        "projects": "Projects",
        "contact_me": "Contact me"
    },
    "not_found": {
        "user_lost": "You've probably got lost",
        "url_not_found": "What you're looking for doesn't or no longer exists in this universe"
    },
    "portfolio": {
        "menu": "Menu"
    },
    "about_me": {
        "title": "About me",
        "type_writer_1": "Young developper in the IT world",
        "type_writer_2": "Always learning new things",
        "first_para": "Ohhh, you're here already ? Yes, it's me speaking to you, on your right, I'll be your guide throughout your journey here. You can call me Astr0ruj !",
        "second_para": "To begin the visit, what better way than with a little introduction to myself.",
        "third_para": "I am a 26 years old french engineer who started his career in the world of AI, image processing and computer vision.",
        "fourth_para": "Since 2 years and a half, I am a self-taught frontend developer in the vast world of mobile and web development.",
        "fifth_para": "Why not learn the backend to become a full stack developer soon ?"
    }
}