{
    "overview": {
        "hello": "Hi, I'm",
        "first_para": "Welcome to my world, new visitor !",
        "second_para": "If you're ready to brave any danger, fasten your seatbelt and get moving !",
        "third_para": "Feel free to have a look at the different icons to find out more about me and my work.",
        "embark": "Scroll and embark on a tour"
    },
    "languages": {
        "french": "French",
        "english": "English"
    },
    "satellites": {
        "about_me": "About me",
        "skills": "Skills",
        "experiences": "Experiences",
        "projects": "Projects",
        "contact_me": "Contact me"
    },
    "not_found": {
        "user_lost": "You've probably got lost",
        "url_not_found": "What you're looking for doesn't or no longer exists in this universe"
    },
    "portfolio": {
        "menu": "Menu"
    },
    "about_me": {
        "title": "About me",
        "subtitle": "Find out more about me...",
        "type_writer_1": "Developer in the IT world",
        "type_writer_2": "Always learning new things",
        "first_para": "Ohhh, you're here already ? I'll be your guide throughout your journey here. You can call me Astr0ruj !",
        "second_para": "To begin the visit, what better way than with a little introduction to myself.",
        "third_para": "I am a 26 years old french engineer who started his career in the world of AI, image processing and computer vision.",
        "fourth_para": "Since 2 years and a half, I am a self-taught frontend developer in the vast world of mobile and web development.",
        "fifth_para": "Why not learn the backend to become a full stack developer soon ?"
    },
    "skills": {
        "title": "Skills",
        "subtitle": "A summary of what I know how to do...",
        "skill_title_1": "My beginnings in development",
        "skill_paragraph_1": "I made my debut in the world of development at the age of 18 by learning Python. \n\nI liked this experience so much that I decided to continue my studies by enrolling in an integrated preparatory cycle and finally in an engineering school: ISEN Toulon. \nDuring these years, I was able to learn to understand, analyse and think about simple, understandable and clean code by learning the basics of development on technologies such as C. \n\nI was also able to learn more by doing a work placement with the Atlantic group in the network and cybersecurity team.",
        "skill_title_2": "My self-taught apprenticeship",
        "skill_paragraph_2": "After graduating from my engineering course as an engineer in image processing and artificial intelligence and not seeing my future career in this field, I decided to turn towards entrepreneurship and mobile and web development on a self-taught basis with the Pépite Toulon programme. \n\nWith their help and on my own, I was able to learn a bit more about the world of entrepreneurship and mobile programming, in particular with the Flutter framework over the course of a year.",
        "skill_title_3": "Years as a front-end developer",
        "skill_paragraph_3": "After this year focused on my self-taught skills development, I decided to discover and fulfil my potential in the world of work with my first permanent contract in a start-up company. \n\nThose years enabled me to learn a lot about mobile front-end development in Flutter, but also in other technologies such as native React, by taking part in projects for clients and eventually becoming a front-end lead dev. \n\nIn my spare time, I've also been able to improve my skills by working on personal projects, both mobile and web.",
        "skill_title_4": "Why not a back-end developer?",
        "skill_paragraph_4": "I've talked a lot about my increasing skills in front-end development, but what about back-end development? \n\nI've been able to participate in additions and modifications to certain projects using Node js, but I still have a lot to learn in order to become a full stack developer.",
        "skill_title_5": "What's next?",
        "skill_paragraph_5": "What an adventure! So what's next? \n\nAs I said, in the near future I'd like to become a full stack developer and, as my career progresses, I'll always enjoy what I do and always be learning new things and new technologies.",
        "content_bitbucket": "Bitbucket is a web hosting and software development management service that uses Git version management software.\n\nI've often used it to host my company's projects and share them with the various developers in my team.",
        "content_c": "This is a low-level, general-purpose, imperative programming language invented in the early 1970's\n\nDuring my years at engineering school, I learnt to program through various projects using this language.",
        "content_firebase": "Firebase is a set of tools for hosting and developing mobile and web applications, which can be used to send notifications and advertisements, and track errors and clicks on the application.\n\nBefore starting to use a back-end with one or more databases, I started by familiarising myself with a noSQL solution for some of my projects, which doesn't need a back-end to work with the front-end.",
        "content_flutter": "Flutter is an open-source user interface software development kit created by Google launched in 2018.\n\nSince I started mobile development, I've used this framework most often for its ease of use, its performance and above all for its community and rich documentation.",
        "content_github": "GitHub is a code hosting platform for version control and collaboration.\n\nI use it every day in my spare time when I decide to work on one of my personal projects.",
        "content_mysql": "MySQL is a relational database management system.\n\nA SQL database that I'm used to working with for mobile development.",
        "content_nodejs": "Node.js is an open-source JavaScript software platform designed for highly competitive, event-driven network applications that need to be able to scale.\n\nVery often used in the projects I've worked on for the back-end side. I'm still new to this framework, but I want to find out more as soon as possible !",
        "content_postman": "Postman is an application for testing APIs.\n\nI use it on a daily basis to facilitate rapid development and wiring from the back-end to the front-end of an application.",
        "content_python": "Python is an interpreted, multi-paradigm, multi-platform programming language. It supports structured, functional and object-oriented imperative programming.\n\nThis language introduced me to development and followed me through to the end of my studies with machine learning, image processing,...",
        "content_reactnative": "React Native est un framework d'applications mobiles open source créé par Facebook.\n\nAnother alternative for mobile development that I've used in a number of professional projects.",
        "content_reactjs": "React is a free JavaScript library developed by Facebook since 2013. The main aim of this library is to facilitate the creation of single-page web applications.\n\nIt's important to learn about web development these days. Well, this portfolio uses this framework !",
        "content_reactredux": "React Redux is the official React UI binding layer for Redux. It allows your React components to read data from a Redux shop and send actions to the shop to update state.\n\nWhether I'm working on React native or React js projects, if I need state app management, React redux is essential to the development of my project !",
        "content_sequelize": "Sequelize (also known as SequelizeJS) is an ORM framework that allows you to connect and map your Node. js application to a database.\n\nI don't use it much as a novice in back-end development, but I know it's a powerful weapon when combined with Node js !",
        "content_sourcetree": "Developed by Atlassian, SourceTree is a GUI-based software application that lets you manage virtually everything without using a terminal, while making your work easier.\n\nI use Git Graph when I'm working on my personal projects with GitHub, but SourceTree is a very good alternative for tracking everyone's progress with projects put on Bitbucket.",
        "content_threejs": "Three.js is a JavaScript library for creating 3D scenes in a web browser.\n\nA bit complicated at first to manage 3D in a 2D application, but the result is worth it, isn't it ?"
    },
    "experiences": {
        "title": "Experiences",
        "subtitle": "What I've been able to do so far...",
        "title_experience_1": "Lead dev front",
        "company_experience_1": "Digital Paca",
        "date_experience_1": "October 2021 - Today",
        "point_1_experience_1": "Development from scratch of an Android / iOS mobile and web solution for donations of vaccines between doctors / pharmacists, etc... Reference: Sauve mon vaccin",
        "point_2_experience_1": "Redesign / improvement, with design imposed by the client, of an Android / iOS mobile cruise booking solution. Reference: Corsica Ferries",
        "point_3_experience_1": "Development from scratch of an Android / iOS mobile application to display information about sports tournaments organised by the client. Reference: Madewis",
        "point_4_experience_1": "Development from scratch of an Android / iOS mobile solution for a social network to meet people with the same interests. Reference: Hobbies",
        "point_5_experience_1": "Development from scratch for a French organisation of an Android / iOS mobile solution to facilitate the display of attendees / absentees during training courses. Reference: La croix rouge française",
        "title_experience_2": "Student entrepreneur",
        "company_experience_2": "Pépite Toulon",
        "date_experience_2": "2020 - 2021",
        "point_1_experience_2": "Self-taught mobile development skills",
        "point_2_experience_2": "Creating a first version of an application from scratch",
        "title_experience_3": "Engineering internship",
        "company_experience_3": "Groupe Atlantic",
        "date_experience_3": "July 2019 - October 2019",
        "point_1_experience_3": "Drawing up the company's cyber security strategy"
    },
    "projects": {
        "title_pro": "Professional projects",
        "subtitle_pro": "A few references from completed projects...",
        "title_private": "Personal projects",
        "subtitle_private": "A few other projects in my spare time...",
        "title_project_pro_1": "Sauve mon vaccin",
        "content_project_pro_1": "Development from scratch of an Android/iOS mobile and web Flutter solution for donations of vaccines between doctors/pharmacists,...",
        "title_project_pro_2": "Corsica Ferries",
        "content_project_pro_2": "Redesign/improvement, with design imposed by the client, of an Android/iOS mobile solution in native React for booking cruises.",
        "title_project_pro_3": "Madewis",
        "content_project_pro_3": "Development from scratch of an Android/iOS mobile application in Flutter to display information about sports tournaments organised by the client.",
        "title_project_pro_4": "Hobbies",
        "content_project_pro_4": "Development from scratch of an Android/iOS mobile solution in Flutter for a social network to meet people with the same interests.",
        "title_project_pro_5": "La croix rouge française",
        "content_project_pro_5": "Development from scratch for a French organisation of an Android/iOS mobile solution using Flutter to facilitate the display of attendees/absentees during training sessions.",
        "title_project_perso_1": "Gemu",
        "content_project_perso_1": "Version 1 of a social networking application for people interested in e-sports and video games developed in Flutter and linked to a Firebase server. Why not a version 2, to be continued....",
        "title_project_perso_2": "My youkounkoun",
        "content_project_perso_2": "An application with a wide variety of basic and complex functions that are very useful when creating a new application. Why start from scratch every time? The front-end application is being developed with Flutter, while the back-end will be developed in Node.js and linked to the MySQL database.",
        "title_project_perso_3": "Portfolio 3D",
        "content_project_perso_3": "Personal website and portfolio to show my work to everyone. This site is developed in React js with Three js."
    },
    "contact_me": {
        "title": "Contact me",
        "subtitle": "Don't hesitate to ask me any questions or give me any feedback...",
        "title_name": "Your name",
        "label_name": "What's your name ?",
        "title_firstname": "Your firstname",
        "label_firstname": "What's your firstname ?",
        "title_post": "Your job / profession",
        "label_post": "What's your job / profession ?",
        "title_email": "Your email",
        "label_email": "What's your email ?",
        "title_message": "Your message",
        "label_message": "What do you want to say ?",
        "send": "Send",
        "loading_send": "Sending...",
        "title_validate": "Mail sent",
        "content_validate": "Thank you. I will get back to you as soon as possible.",
        "title_error": "Error",
        "content_error_1": "Not all fields are filled in.",
        "content_error_2": "Something went wrong."
    }
}