{
    "overview": {
        "hello": "Salut, je suis",
        "first_para": "Bienvenue dans mon monde nouveau visiteur !",
        "second_para": "Dans un premier temps, tu te poses peut-être la question de pourquoi avoir pris le temps de créer ce monde ?",
        "third_para": "Simplement afin que chacun d'un peu curieux et qui souhaite partir pour un voyage afin de mieux me connaître puisse le faire de la meilleure des façons.",
        "fourth_para": "Alors si tu es prêt à braver tous les dangers, attache ta ceinture et en avant toute !",
        "fifth_para": "Sinon je t'ai laissé 3 petits boutons afin d'en savoir plus sur ma personne et mon travail sans se mettre en danger, n'hésite pas à y jeter un oeil aussi.",
        "embark": "Scrollez et embarquez pour une visite"
    },
    "languages": {
        "french": "Français",
        "english": "Anglais"
    },
    "satellites": {
        "about_me": "À propos de moi",
        "skills": "Compétences",
        "experiences": "Expériences",
        "projects": "Projets",
        "contact_me": "Me contacter"
    },
    "not_found": {
        "user_lost": "Vous vous êtes sûrement perdus",
        "url_not_found": "Ce que vous recherchez n'existe pas ou plus dans cet univers"
    },
    "portfolio": {
        "menu": "Menu"
    },
    "about_me": {
        "title": "À propos de moi",
        "type_writer_1": "Jeune développeur dans le monde de l'informatique",
        "type_writer_2": "Apprendre toujours de nouvelles choses",
        "first_para": "Ohhh tu es déjà là?  Oui, c'est moi qui te parle, sur ta droite, je serais ton guide tout au long de ton voyage ici. Tu peux m'appeler Astr0ruj !",
        "second_para": "Pour commencer la visite, quoi de mieux qu'une petite présentation de moi-même.",
        "third_para": "Je suis un ingénieur français de 26 ans qui a commencé sa carrière dans le monde de l'IA, du traitement d'images et de la vision par ordinateur.",
        "fourth_para": "Depuis 2 ans et demi, je suis un développeur frontend autodidacte dans le vaste monde du développement mobile et web.",
        "fifth_para": "Pourquoi ne pas apprendre le backend pour devenir bientôt un développeur full stack ?"
    }
}