{
    "overview": {
        "hello": "Salut, je suis",
        "first_para": "Bienvenue dans mon monde nouveau visiteur !",
        "second_para": "Dans un premier temps, tu te poses peut-être la question de pourquoi avoir pris le temps de créer ce monde ?",
        "third_para": "Simplement afin que chacun d'un peu curieux et qui souhaite partir pour un voyage afin de mieux me connaître puisse le faire de la meilleure des façons.",
        "fourth_para": "Alors si tu es prêt à braver tous les dangers, attache ta ceinture et en avant toute !",
        "fifth_para": "Sinon je t'ai laissé 3 petits boutons afin d'en savoir plus sur ma personne et mon travail sans se mettre en danger, n'hésite pas à y jeter un oeil aussi.",
        "embark": "Scrollez et embarquez pour une visite"
    },
    "languages": {
        "french": "Français",
        "english": "Anglais"
    },
    "satellites": {
        "about_me": "À propos de moi",
        "skills": "Compétences",
        "experiences": "Expériences",
        "projects": "Projets",
        "contact_me": "Me contacter"
    },
    "not_found": {
        "user_lost": "Vous vous êtes sûrement perdus",
        "url_not_found": "Ce que vous recherchez n'existe pas ou plus dans cet univers"
    },
    "portfolio": {
        "menu": "Menu"
    },
    "about_me": {
        "title": "À propos de moi",
        "type_writer_1": "Jeune développeur dans le monde de l'informatique",
        "type_writer_2": "Apprendre toujours de nouvelles choses",
        "first_para": "Ohhh tu es déjà là ?  Oui, c'est moi qui te parle, sur ta droite, je serais ton guide tout au long de ton voyage ici. Tu peux m'appeler Astr0ruj !",
        "second_para": "Pour commencer la visite, quoi de mieux qu'une petite présentation de moi-même.",
        "third_para": "Je suis un ingénieur français de 26 ans qui a commencé sa carrière dans le monde de l'IA, du traitement d'images et de la vision par ordinateur.",
        "fourth_para": "Depuis 2 ans et demi, je suis un développeur frontend autodidacte dans le vaste monde du développement mobile et web.",
        "fifth_para": "Pourquoi ne pas apprendre le backend pour devenir bientôt un développeur full stack ?"
    },
    "skills": {
        "title": "Compétences",
        "skill_title_1": "Mes débuts dans le développement",
        "skill_paragraph_1": "J'ai fait mes débuts dans le monde du développement à l'âge de 18 ans en apprenant le Python. \n\nCette expérience m'ayant plus, j'ai voulu continuer en intégrant un cycle préparatoire intégré et enfin une école d'ingénieur : ISEN Toulon. \nDurant ces années, j'ai pu apprendre à comprendre, à analyser et réfléchir à un code simple, compréhensible et propre en apprenant les bases du développement sur des technologies comme le C. \n\nJ'ai aussi pu en apprendre davantage en faisant notamment un stage au sein du groupe Atlantic avec l'équipe réseau et cybersécurité.",
        "skill_title_2": "Mon apprentissage autodidacte",
        "skill_paragraph_2": "Après une diplômation dans ma formation d'ingénieur en tant qu'ingénieur dans le traitement de l'image et l'intelligence artificielle et ne voyant pas ma future carrière dans ce domaine, j'ai décidé de m'orienter vers l'entrepreneuriat et le développement mobile et web de manière autodidacte avec le programme Pépite Toulon. \n\nJ'ai pu apprendre avec leur aide et par moi-même un peu plus sur le monde de l'entrepreneuriat et la programmation mobile avec notamment le framework Flutter durant une année.",
        "skill_title_3": "Années de développeur front",
        "skill_paragraph_3": "Après cette année concentrée sur ma montée en compétences autodidacte, j'ai décidé de découvrir et de m'épanouir dans le monde du travail avec un premier CDI au sein d'une start-up. \n\nCes années-là m'ont permis d'en apprendre beaucoup sur le développement front en mobile en Flutter, mais aussi dans d'autres technologies comme par exemple le React native en participant à des projets pour des clients jusqu'à devenir Lead dev front. \n\nJ'ai pu aussi de mon côté durant mon temps libre, améliorer mes compétences en faisant des projets personnels que ce soit mobile ou web.",
        "skill_title_4": "Et pourquoi pas développeur back ?",
        "skill_paragraph_4": "J'ai beaucoup parlé de ma montée en compétences dans le développement front, mais qu'en est-il du développement back ? \n\nJ'ai pu participé à des ajouts et modifications dans certains projets en faisant du Node js mais j'ai encore beaucoup à apprendre afin de devenir un développeur full stack.",
        "skill_title_5": "L'avenir...",
        "skill_paragraph_5": "Quelle aventure déjà ! Et la suite alors ? \n\nComme je l'ai dit, j'aimerai dans un futur proche, devenir un développeur full stack et par la suite de ma carrière, toujours prendre du plaisir dans ce que je fais et apprendre toujours de nouvelles choses et de nouvelles technologies."
    },
    "experiences": {
        "title": "Expériences",
        "title_experience_1": "Lead dev front",
        "company_experience_1": "Digital Paca",
        "date_experience_1": "Octobre 2021 - Aujourd'hui",
        "point_1_experience_1": "Développement from scratch d'une solution mobile Android/iOS et web de dons de vaccins entre médecins/pharmaciens,... Référence: Sauve mon vaccin",
        "point_2_experience_1": "Refonte/Amélioration avec design imposé par le client d'une solution mobile Android/iOS de réservation de croisières. Référence: Corsica Ferries",
        "point_3_experience_1": "Développement from scratch d'une application mobile Android/iOS afin de visualiser les informations des tournois sportifs organisés par le client. Référence: Madewis",
        "point_4_experience_1": "Développement from scratch d'une solution mobile Android/iOS d'un réseau social pour rencontrer des gens ayant les mêmes centres d'interêts. Référence: Hobbies",
        "point_5_experience_1": "Développement from scratch pour un organisme français d'une solution mobile Android/iOS pour faciliter la visualisation des présents/absents lors des formations. Référence: La croix rouge française",
        "title_experience_2": "Étudiant entrepreneur",
        "company_experience_2": "Pépite Toulon",
        "date_experience_2": "2020 - 2021",
        "point_1_experience_2": "Apprentissage de manière autodidacte du développement mobile",
        "point_2_experience_2": "Création d'une première version d'une application from scratch",
        "title_experience_3": "Stage ingénieur",
        "company_experience_3": "Groupe Atlantic",
        "date_experience_3": "Juillet 2019 - Octobre 2019",
        "point_1_experience_3": "Élaboration de la stratégie cybersécurité de l'entreprise"
    },
    "projects": {
        "title_pro": "Projets professionnels",
        "title_private": "Projets personnels",
        "title_project_pro_1": "Sauve mon vaccin",
        "content_project_pro_1": "Développement from scratch d'une solution mobile Android/iOS et web en Flutter de dons de vaccins entre médecins/pharmaciens,...",
        "title_project_pro_2": "Corsica Ferries",
        "content_project_pro_2": "Refonte/Amélioration avec design imposé par le client d'une solution mobile Android/iOS en React native de réservation de croisières.",
        "title_project_pro_3": "Madewis",
        "content_project_pro_3": "Développement from scratch d'une application mobile Android/iOS en Flutter afin de visualiser les informations des tournois sportifs organisés par le client.",
        "title_project_pro_4": "Hobbies",
        "content_project_pro_4": "Développement from scratch d'une solution mobile Android/iOS en Flutter d'un réseau social pour rencontrer des gens ayant les mêmes centres d'interêts.",
        "title_project_pro_5": "La croix rouge française",
        "content_project_pro_5": "Développement from scratch pour un organisme français d'une solution mobile Android/iOS en Flutter pour faciliter la visualisation des présents/absents lors des formations.",
        "title_project_perso_1": "Gemu",
        "content_project_perso_1": "Version 1 d'une application de réseau social pour les personnes intéressées par l'e-sport et les jeux vidéo développée en Flutter reliée à un serveur Firebase. Pourquoi pas une version 2, affaire à suivre....",
        "title_project_perso_2": "My youkounkoun",
        "content_project_perso_2": "Une application dotée d'une grande variété de fonctions de base et de fonctions complexes très utiles lors de la création d'une nouvelle application. Pourquoi repartir de zéro à chaque fois ? L'application front-end est développée avec Flutter et le back-end sera développé en Node.js en lien avec la base de données MySQL.",
        "title_project_perso_3": "Portfolio 3D",
        "content_project_perso_3": "Site et portfolio personnel afin de montrer mon travail à tous. Ce site est développé en React js avec du Three js."
    },
    "contact_me": {
        "title": "Me contacter",
        "title_name": "Votre nom",
        "label_name": "Quel est votre nom ?",
        "title_firstname": "Votre prénom",
        "label_firstname": "Quel est votre prénom ?",
        "title_post": "Votre poste / métier",
        "label_post": "Quel est votre poste / métier ?",
        "title_email": "Votre email",
        "label_email": "Quel est votre email ?",
        "title_message": "Votre message",
        "label_message": "Que voulez-vous dire ?",
        "send": "Envoyer",
        "loading_send": "Envoi en cours...",
        "title_validate": "Mail envoyé",
        "content_validate": "Merci. Je vous répondrai dans les plus brefs délais.",
        "title_error": "Erreur",
        "content_error_1": "Les champs ne sont pas tous remplis.",
        "content_error_2": "Quelque chose n'a pas fonctionné."
    },
    "wip": {
        "label": "Travaux encore en cours..."
    }
}